Repository: sampulklover/sampul_app_v2
Catalog: lib/l10n/app_*.arb
Languages: ms

source: Login
ms: Log Masuk

source: Welcome back
ms: Selamat kembali

# signInToContinue
source: Sign in to continue to Sampul
ms: Log masuk untuk terus ke Sampul

source: Email
ms: E-mel

# emailHint
source: you@example.com
ms: anda@contoh.com

source: Password
ms: Kata laluan

source: Forgot password?
ms: Lupa kata laluan?

# signInFailed
source: Sign in failed. Please try again.
ms: Log masuk gagal. Sila cuba lagi.

# signInFailedWithError
source: Sign in failed: {error}
ms: Log masuk gagal: {error}

# unexpectedError
source: An unexpected error occurred: {error}
ms: Ralat tidak dijangka berlaku: {error}

# googleSignInCancelled
source: Google sign-in was cancelled or failed
ms: Log masuk Google dibatalkan atau gagal

# googleSignInFailed
source: Google sign-in failed: {error}
ms: Log masuk Google gagal: {error}

source: Signing in…
ms: Sedang log masuk…

source: Continue with Google
ms: Teruskan dengan Google

# dontHaveAccount
source: Don't have an account?
ms: Tiada akaun?

source: Sign up
ms: Daftar

source: OR
ms: ATAU

# emailRequired
source: Email is required
ms: E-mel diperlukan

# emailInvalid
source: Enter a valid email
ms: Masukkan e-mel yang sah

# passwordRequired
source: Password is required
ms: Kata laluan diperlukan

# passwordMinLength
source: Password must be at least 6 characters
ms: Kata laluan mestilah sekurang-kurangnya 6 aksara

source: About Your Will
ms: Mengenai Wasiat Anda

source: Let's create your will
ms: Mari kita buat wasiat anda

# willDescription
source: Bring your profile, family, assets, and wishes together in one clear document.
ms: Satukan profil, keluarga, aset, dan hasrat anda dalam satu dokumen yang jelas.

source: Let's list your digital assets
ms: Mari kita senaraikan aset digital anda

# assetsDescription
source: Keep important online accounts and platforms in one place so your will stays clear and up to date.
ms: Simpan akaun dan platform dalam talian yang penting di satu tempat supaya wasiat anda kekal jelas dan terkini.

source: Let's set up your family account
ms: Mari kita sediakan akaun keluarga anda

# trustDescription
source: Clear wishes, for the people you love.
ms: Hasrat yang jelas, untuk orang yang anda sayangi.

source: Let's plan your Hibah gifts
ms: Mari kita rancangkan hadiah Hibah anda

# hibahDescription
source: Decide clearly who should receive your assets as a lifetime gift.
ms: Tentukan dengan jelas siapa yang harus menerima aset anda sebagai hadiah seumur hidup.

# onboardingTitle1
source: Put your wealth in writing
ms: Letakkan kekayaan anda dalam tulisan

# onboardingSubtitle1
source: Without a Wasiat, your wealth could end up in the wrong hands. Get it sorted today—fast, legal, and dispute-free.
ms: Tanpa Wasiat, kekayaan anda mungkin jatuh ke tangan yang salah. Selesaikannya hari ini—pantas, sah, dan bebas pertikaian.

# onboardingTitle2
source: Do more with Sampul Trust
ms: Lakukan lebih banyak dengan Sampul Trust

# onboardingSubtitle2
source: Lock in your assets, invest for the future, and ensure your loved ones get what's rightfully theirs.
ms: Kunci aset anda, labur untuk masa depan, dan pastikan orang tersayang mendapat apa yang menjadi hak mereka.

# onboardingTitle3
source: Don't let emotions decide.
ms: Jangan biarkan emosi menentukan.

# onboardingSubtitle3
source: A professional executor ensures your will is followed—no family drama, no legal mess, just a smooth handover.
ms: Pelaksana profesional memastikan wasiat anda diikuti—tiada drama keluarga, tiada kekacauan undang-undang, hanya penyerahan yang lancar.

source: Settings
ms: Tetapan

source: Language
ms: Bahasa

source: Select Language
ms: Pilih Bahasa

source: English
ms: Bahasa Inggeris

source: Malay
ms: Bahasa Melayu

source: Language changed
ms: Bahasa telah ditukar

source: Referrals
ms: Rujukan

source: My Assets
ms: Aset Saya

source: See All →
ms: Lihat Semua →

source: My Family
ms: Keluarga Saya

source: Submitted
ms: Dihantar

source: Approved
ms: Diluluskan

source: Rejected
ms: Ditolak

source: Draft
ms: Draf

source: Your plan is active
ms: Pelan anda aktif

source: Family Account
ms: Akaun Keluarga

source: Create Your First Trust Fund
ms: Cipta Amanah Keluarga Pertama Anda

source: Add New Trust Fund
ms: Tambah Amanah Keluarga Baru

source: Tap to get started
ms: Ketik untuk mula

source: Will
ms: Wasiat

source: Trust
ms: Amanah

source: Others
ms: Lain-lain

source: Assets
ms: Aset

source: Family
ms: Keluarga

source: Checklist
ms: Senarai Semak

source: Execution
ms: Pelaksanaan

source: Aftercare
ms: Penjagaan Selepas

source: Add
ms: Tambah

source: Loading...
ms: Memuatkan...

source: Unknown
ms: Tidak diketahui

source: Terminate Subscriptions
ms: Tamatkan Langganan

source: Transfer as Gift
ms: Pindahkan sebagai Hadiah

source: Settle Debts
ms: Selesaikan Hutang

source: Beneficiary
ms: Penerima Manfaat

source: Guardian
ms: Penjaga
